---
kind: property
id: P:Autodesk.Revit.DB.CylindricalHelix.ZVector
source: html/79b811b5-a7cd-2e6b-bf62-a4942ea57ef9.htm
---
# Autodesk.Revit.DB.CylindricalHelix.ZVector Property

The Z direction vector, which is same as the axis direction vector.

## Syntax (C#)
```csharp
public XYZ ZVector { get; }
```